In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in c:\users\green zone\anaconda3\lib\site-packages (3.3.1)
Requirement already satisfied: py4j==0.10.9.5 in c:\users\green zone\anaconda3\lib\site-packages (from pyspark) (0.10.9.5)

In [2]:
import pyspark

In [3]:
import pandas as pd

In [103]:
pd.read_csv(r'C:\Users\green zone\Desktop\Personal_Dataset\csv_file.csv')

   ID      Name  Age Gen  Salary       City
0   1      Aman   23   m   34000      Noida
1   2     Baman   34   m   65000      Noida
2   3   Shivani   18   f   80000      Delhi
3   4  Srinivas   45   m   25000      Solan
4   5     Akash   35   m   80000  Bengaluru
5   1      Aman   23   m   34000      Noida

## Create Spark Session

In [44]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, lit

In [9]:
spark= SparkSession.builder.appName('Practice_Pyspark').getOrCreate()
spark

## Spark Operation

In [15]:
#Read CSV File

In [104]:
df= spark.read.csv(r'C:\Users\green zone\Desktop\Personal_Dataset\csv_file.csv', header=True)
df.show()

+---+--------+---+---+------+---------+
| ID|    Name|Age|Gen|Salary|     City|
+---+--------+---+---+------+---------+
|  1|    Aman| 23|  m| 34000|    Noida|
|  2|   Baman| 34|  m| 65000|    Noida|
|  3| Shivani| 18|  f| 80000|    Delhi|
|  4|Srinivas| 45|  m| 25000|    Solan|
|  5|   Akash| 35|  m| 80000|Bengaluru|
|  1|    Aman| 23|  m| 34000|    Noida|
+---+--------+---+---+------+---------+

In [105]:
#Checking Schema and datatype

In [106]:
df.printSchema()

root
 |-- ID: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- Gen: string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- City: string (nullable = true)

In [107]:
#Rename single Column

In [108]:
df=df.withColumnRenamed('ID', 'Id')
df.show()

+---+--------+---+---+------+---------+
| Id|    Name|Age|Gen|Salary|     City|
+---+--------+---+---+------+---------+
|  1|    Aman| 23|  m| 34000|    Noida|
|  2|   Baman| 34|  m| 65000|    Noida|
|  3| Shivani| 18|  f| 80000|    Delhi|
|  4|Srinivas| 45|  m| 25000|    Solan|
|  5|   Akash| 35|  m| 80000|Bengaluru|
|  1|    Aman| 23|  m| 34000|    Noida|
+---+--------+---+---+------+---------+

In [109]:
#Rename Multiple Columns

In [110]:
df=df.selectExpr('Id as emp_id','Name as emp_name', 'Age as emp_age','Gen as emp_gen',
                  'Salary as emp_salary','City as emp_city')
df.show()

+------+--------+-------+-------+----------+---------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|
+------+--------+-------+-------+----------+---------+
|     1|    Aman|     23|      m|     34000|    Noida|
|     2|   Baman|     34|      m|     65000|    Noida|
|     3| Shivani|     18|      f|     80000|    Delhi|
|     4|Srinivas|     45|      m|     25000|    Solan|
|     5|   Akash|     35|      m|     80000|Bengaluru|
|     1|    Aman|     23|      m|     34000|    Noida|
+------+--------+-------+-------+----------+---------+

In [111]:
#Add a column

In [112]:
df= df.withColumn('Country', lit('India'))
df.show()

#Add multiple Column
#df2= df.withColumn('Country', lit('India')).withColumn('State', lit('Mixed'))

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
+------+--------+-------+-------+----------+---------+-------+

In [113]:
#Filter data

In [114]:
df.filter(col('Salary')>50000).show()

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
+------+--------+-------+-------+----------+---------+-------+

In [115]:
#Sort data

In [116]:
df.show()

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
+------+--------+-------+-------+----------+---------+-------+

In [117]:
df.sort( df.emp_salary.desc(), df.emp_age.asc() ).show() #SORT function

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
+------+--------+-------+-------+----------+---------+-------+

In [118]:
df.orderBy(df.emp_salary.desc()).show() #Order By function

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
+------+--------+-------+-------+----------+---------+-------+

In [119]:
#Remove Duplicates

In [121]:
df.distinct().show()
#df.dropDuplicate().show()

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
+------+--------+-------+-------+----------+---------+-------+

In [124]:
#Seeing original data
df.show()

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
|     1|    Aman|     23|      m|     34000|    Noida|  India|
+------+--------+-------+-------+----------+---------+-------+

In [123]:
#from multiple columns
df.dropDuplicates(['emp_id', 'emp_name']).show()

+------+--------+-------+-------+----------+---------+-------+
|emp_id|emp_name|emp_age|emp_gen|emp_salary| emp_city|Country|
+------+--------+-------+-------+----------+---------+-------+
|     1|    Aman|     23|      m|     34000|    Noida|  India|
|     2|   Baman|     34|      m|     65000|    Noida|  India|
|     3| Shivani|     18|      f|     80000|    Delhi|  India|
|     4|Srinivas|     45|      m|     25000|    Solan|  India|
|     5|   Akash|     35|      m|     80000|Bengaluru|  India|
+------+--------+-------+-------+----------+---------+-------+